src/test/testtool/ZoekMetPostcodeEnHuisnummer/02/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><StUF:Fo03Bericht xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310"
                  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:StUF="http://www.egem.nl/StUF/StUF0301"
                  xmlns:ZKN="http://www.egem.nl/StUF/sector/zkn/0310"
                  xmlns:xs="http://www.w3.org/2001/XMLSchema">
   <StUF:stuurgegevens>
      <StUF:berichtcode>Fo03</StUF:berichtcode>
      <StUF:zender>
         <StUF:organisatie>NEDGR</StUF:organisatie>
         <StUF:applicatie>NEDMAG_VnA</StUF:applicatie>
      </StUF:zender>
      <StUF:ontvanger>
         <StUF:organisatie/>
         <StUF:applicatie>LBA</StUF:applicatie>
         <StUF:administratie/>
         <StUF:gebruiker>SH2102</StUF:gebruiker>
      </StUF:ontvanger>
      <StUF:referentienummer>7a920830-5194-435a-b8c5-e79a756d0847</StUF:referentienummer>
      <StUF:tijdstipBericht>2024010814194200</StUF:tijdstipBericht>
      <StUF:crossRefnummer>659bf66e3ee6</StUF:crossRefnummer>
   </StUF:stuurgegevens>
   <StUF:body>
      <StUF:code>500</StUF:code>
      <StUF:plek>server</StUF:plek>
      <StUF:omschrijving>some negative response from BRP API Personen received by PostBRPPersonenBevragenTestEnv</StUF:omschrijving>
      <StUF:details>TechnicalError some negative response from BRP API Personen received by PostBRPPersonenBevragenTestEnv </StUF:details>
      <StUF:detailsXML>
         <detailsXml>
            <root>
               <root>
                  <text>The app LBA is not allowed for this request</text>
               </root>
            </root>
         </detailsXml>
      </StUF:detailsXML>
   </StUF:body>
</StUF:Fo03Bericht>
</soapenv:Body></soapenv:Envelope>